In [1]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import numpy as np

In [2]:
df = pd.read_csv('3250 B/Module 1/MessyData.csv')

In [3]:
df.head()

,Name,PhoneNumber,City,Address,PostalCode,BirthDate,Income,CreditLimit,MaritalStatus
0,Thane Arthur Andrews,8675550155,Yellowknife,25 West Arlington Drive,X1A3C7,30-Jan-87,77569.0,500,Single
1,Ty Tiina Hume,867-555-0148,Yellowknife,214 West Maple Dr.,X1A3J6,05-Sep-91,117630.0,5000,Divorced
2,Anita Travert,613-555-0111,Ottawa,24 Constitution St.,K2B8E3,02-May-52,NaN,3000,Married
3,Odilon Vera Ó Maoil Riain,204-555-0105,Winnipeg,7941 Greenview Street,R3G2J6,31-Oct-81,97911.0,4000,Divorced
4,Dot Cloé Jonasen,902555-0157,Charlottetown,74 Monroe Street,C1A2V3,25-Jul-01,NaN,high,NaN

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           30 non-null     object
 1   PhoneNumber    30 non-null     object
 2   City           30 non-null     object
 3   Address        30 non-null     object
 4   PostalCode     30 non-null     object
 5   BirthDate      30 non-null     object
 6   Income         26 non-null     float64
 7   CreditLimit    30 non-null     object
 8   MaritalStatus  24 non-null     object
dtypes: float64(1), object(8)
memory usage: 2.2+ KB

In [5]:
# count the total number of missing values in the data
df.isnull().sum()

Name             0
PhoneNumber      0
City             0
Address          0
PostalCode       0
BirthDate        0
Income           4
CreditLimit      0
MaritalStatus    6
dtype: int64

In [6]:
# count the total number of missing values in the data
df.isnull().sum().sum()

10

In [7]:
# use size to get the total number of data points in a data set
df.size

270

In [8]:
df.shape

(30, 9)

In [9]:
# or use shape to manually calculate total number of data points
df.shape[0] * df.shape[1]

270

In [10]:
# calculate the % of missing data
df.isnull().sum().sum()/df.size

0.037037037037037035

In [11]:
# calculate the % of missing data by column
df.isnull().sum()/df.shape[0]

Name             0.000000
PhoneNumber      0.000000
City             0.000000
Address          0.000000
PostalCode       0.000000
BirthDate        0.000000
Income           0.133333
CreditLimit      0.000000
MaritalStatus    0.200000
dtype: float64

In [12]:
df.shape

(30, 9)

In [13]:
# simulate what would happen if we drop missing data
df.dropna().info()

<class 'pandas.core.frame.DataFrame'>
Index: 21 entries, 0 to 28
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           21 non-null     object
 1   PhoneNumber    21 non-null     object
 2   City           21 non-null     object
 3   Address        21 non-null     object
 4   PostalCode     21 non-null     object
 5   BirthDate      21 non-null     object
 6   Income         21 non-null     float64
 7   CreditLimit    21 non-null     object
 8   MaritalStatus  21 non-null     object
dtypes: float64(1), object(8)
memory usage: 1.6+ KB

In [14]:
# use string method to check for alphabetical data points within a column
df[df['CreditLimit'].str.isalpha()]

,Name,PhoneNumber,City,Address,PostalCode,BirthDate,Income,CreditLimit,MaritalStatus
4,Dot Cloé Jonasen,902555-0157,Charlottetown,74 Monroe Street,C1A2V3,25-Jul-01,NaN,high,NaN

In [15]:
# we could directly replace the value using replace()
df2 = df.copy()

In [16]:
df2['CreditLimit'] = df2['CreditLimit'].replace('high',np.nan)

In [17]:
df2.head()

,Name,PhoneNumber,City,Address,PostalCode,BirthDate,Income,CreditLimit,MaritalStatus
0,Thane Arthur Andrews,8675550155,Yellowknife,25 West Arlington Drive,X1A3C7,30-Jan-87,77569.0,500,Single
1,Ty Tiina Hume,867-555-0148,Yellowknife,214 West Maple Dr.,X1A3J6,05-Sep-91,117630.0,5000,Divorced
2,Anita Travert,613-555-0111,Ottawa,24 Constitution St.,K2B8E3,02-May-52,NaN,3000,Married
3,Odilon Vera Ó Maoil Riain,204-555-0105,Winnipeg,7941 Greenview Street,R3G2J6,31-Oct-81,97911.0,4000,Divorced
4,Dot Cloé Jonasen,902555-0157,Charlottetown,74 Monroe Street,C1A2V3,25-Jul-01,NaN,NaN,NaN

In [18]:
# the other way to replace wrong data types is to force-convert to numeric
df['CreditLimit'] = pd.to_numeric(df['CreditLimit'], errors='coerce')

In [19]:
df.head()

,Name,PhoneNumber,City,Address,PostalCode,BirthDate,Income,CreditLimit,MaritalStatus
0,Thane Arthur Andrews,8675550155,Yellowknife,25 West Arlington Drive,X1A3C7,30-Jan-87,77569.0,500.0,Single
1,Ty Tiina Hume,867-555-0148,Yellowknife,214 West Maple Dr.,X1A3J6,05-Sep-91,117630.0,5000.0,Divorced
2,Anita Travert,613-555-0111,Ottawa,24 Constitution St.,K2B8E3,02-May-52,NaN,3000.0,Married
3,Odilon Vera Ó Maoil Riain,204-555-0105,Winnipeg,7941 Greenview Street,R3G2J6,31-Oct-81,97911.0,4000.0,Divorced
4,Dot Cloé Jonasen,902555-0157,Charlottetown,74 Monroe Street,C1A2V3,25-Jul-01,NaN,NaN,NaN

In [20]:
# convert birthday column from object to datetime data type
df['BirthDate'] = pd.to_datetime(df['BirthDate'])

/var/folders/75/tr_v06ms4k7gy38vcppxbcf80000gn/T/ipykernel_16633/2124381247.py:2: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df['BirthDate'] = pd.to_datetime(df['BirthDate'])

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           30 non-null     object
 1   PhoneNumber    30 non-null     object
 2   City           30 non-null     object
 3   Address        30 non-null     object
 4   PostalCode     30 non-null     object
 5   BirthDate      30 non-null     datetime64[ns]
 6   Income         26 non-null     float64
 7   CreditLimit    29 non-null     float64
 8   MaritalStatus  24 non-null     object
dtypes: datetime64[ns](1), float64(2), object(6)
memory usage: 2.2+ KB

In [22]:
df.head()

,Name,PhoneNumber,City,Address,PostalCode,BirthDate,Income,CreditLimit,MaritalStatus
0,Thane Arthur Andrews,8675550155,Yellowknife,25 West Arlington Drive,X1A3C7,1987-01-30,77569.0,500.0,Single
1,Ty Tiina Hume,867-555-0148,Yellowknife,214 West Maple Dr.,X1A3J6,1991-09-05,117630.0,5000.0,Divorced
2,Anita Travert,613-555-0111,Ottawa,24 Constitution St.,K2B8E3,2052-05-02,NaN,3000.0,Married
3,Odilon Vera Ó Maoil Riain,204-555-0105,Winnipeg,7941 Greenview Street,R3G2J6,1981-10-31,97911.0,4000.0,Divorced
4,Dot Cloé Jonasen,902555-0157,Charlottetown,74 Monroe Street,C1A2V3,2001-07-25,NaN,NaN,NaN

In [23]:
check_years = []
greater_than_2024 = []
for i in df['BirthDate']:
    check_years.append(i.year)
    if i.year > 2024:
        greater_than_2024.append(i)

In [24]:
check_years.sort()
print(min(check_years), max(check_years))

1974 2068

In [25]:
greater_than_2024

[Timestamp('2052-05-02 00:00:00'),
 Timestamp('2062-03-15 00:00:00'),
 Timestamp('2068-07-25 00:00:00'),
 Timestamp('2062-01-24 00:00:00'),
 Timestamp('2056-11-03 00:00:00'),
 Timestamp('2058-02-27 00:00:00'),
 Timestamp('2065-07-31 00:00:00'),
 Timestamp('2058-03-23 00:00:00')]

In [26]:
import datetime

In [27]:
datetime.datetime.today().year

2024

In [28]:
def fix_date(x):
    if x.year > datetime.datetime.today().year:
        year = x.year - 100
    else:
        year = x.year
    return datetime.date(year, x.month, x.day)

In [29]:
df['BirthDate'] = df['BirthDate'].apply(fix_date)

In [30]:
df.head()

,Name,PhoneNumber,City,Address,PostalCode,BirthDate,Income,CreditLimit,MaritalStatus
0,Thane Arthur Andrews,8675550155,Yellowknife,25 West Arlington Drive,X1A3C7,1987-01-30,77569.0,500.0,Single
1,Ty Tiina Hume,867-555-0148,Yellowknife,214 West Maple Dr.,X1A3J6,1991-09-05,117630.0,5000.0,Divorced
2,Anita Travert,613-555-0111,Ottawa,24 Constitution St.,K2B8E3,1952-05-02,NaN,3000.0,Married
3,Odilon Vera Ó Maoil Riain,204-555-0105,Winnipeg,7941 Greenview Street,R3G2J6,1981-10-31,97911.0,4000.0,Divorced
4,Dot Cloé Jonasen,902555-0157,Charlottetown,74 Monroe Street,C1A2V3,2001-07-25,NaN,NaN,NaN

In [31]:
df['BirthDate'] = pd.to_datetime(df['BirthDate'])

In [32]:
df.head()

,Name,PhoneNumber,City,Address,PostalCode,BirthDate,Income,CreditLimit,MaritalStatus
0,Thane Arthur Andrews,8675550155,Yellowknife,25 West Arlington Drive,X1A3C7,1987-01-30,77569.0,500.0,Single
1,Ty Tiina Hume,867-555-0148,Yellowknife,214 West Maple Dr.,X1A3J6,1991-09-05,117630.0,5000.0,Divorced
2,Anita Travert,613-555-0111,Ottawa,24 Constitution St.,K2B8E3,1952-05-02,NaN,3000.0,Married
3,Odilon Vera Ó Maoil Riain,204-555-0105,Winnipeg,7941 Greenview Street,R3G2J6,1981-10-31,97911.0,4000.0,Divorced
4,Dot Cloé Jonasen,902555-0157,Charlottetown,74 Monroe Street,C1A2V3,2001-07-25,NaN,NaN,NaN

In [33]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           30 non-null     object
 1   PhoneNumber    30 non-null     object
 2   City           30 non-null     object
 3   Address        30 non-null     object
 4   PostalCode     30 non-null     object
 5   BirthDate      30 non-null     datetime64[ns]
 6   Income         26 non-null     float64
 7   CreditLimit    29 non-null     float64
 8   MaritalStatus  24 non-null     object
dtypes: datetime64[ns](1), float64(2), object(6)
memory usage: 2.2+ KB

In [34]:
# anytime you're working with categorical data, check the unique values to see if any spelling mistakes and also for a sense of what data is available
sorted(df['City'].unique())

['Charlottetown',
 'Charlotttetownn',
 'Ottawa',
 'Ottawas',
 'Toronot',
 'Toronto',
 'Winnipeg',
 'Winnipegg',
 'Yellowknife']

In [35]:
df['MaritalStatus'].unique()

array(['Single', 'Divorced', 'Married', nan], dtype=object)

In [36]:
# we can use the replace function to replace mistakes
df['City'] = df['City'].replace('Charlotttetownn', 'Charlottetown')

In [37]:
sorted(df['City'].unique())

['Charlottetown',
 'Ottawa',
 'Ottawas',
 'Toronot',
 'Toronto',
 'Winnipeg',
 'Winnipegg',
 'Yellowknife']

In [38]:
# instead of using replace, we can use map()
# when using map() you need to include everything, even the correct spellings
corrections_dict = {'Ottawa':'Ottawa',
                    'Ottawas':'Ottawa',
                    'Toronot':'Toronto',
                    'Toronto':'Toronto',
                    'Winnipeg':'Winnipeg',
                    'Winnipegg':'Winnipeg',
                    'Yellowknife':'Yellowknife',
                    'Charlottetown':'Charlottetown'}

In [39]:
df['City'] = df['City'].map(corrections_dict)

In [40]:
df.City.unique()

array(['Yellowknife', 'Ottawa', 'Winnipeg', 'Charlottetown', 'Toronto'],
      dtype=object)

In [41]:
df['Contact'] = df[['BirthDate']].applymap(lambda x: 'Contact' if x.year > 1995 else 'Do not contact')

In [42]:
df['BirthYear'] = df['BirthDate'].apply(lambda x: x.year)

In [43]:
df.head()

,Name,PhoneNumber,City,Address,PostalCode,BirthDate,Income,CreditLimit,MaritalStatus,Contact,BirthYear
0,Thane Arthur Andrews,8675550155,Yellowknife,25 West Arlington Drive,X1A3C7,1987-01-30,77569.0,500.0,Single,Do not contact,1987
1,Ty Tiina Hume,867-555-0148,Yellowknife,214 West Maple Dr.,X1A3J6,1991-09-05,117630.0,5000.0,Divorced,Do not contact,1991
2,Anita Travert,613-555-0111,Ottawa,24 Constitution St.,K2B8E3,1952-05-02,NaN,3000.0,Married,Do not contact,1952
3,Odilon Vera Ó Maoil Riain,204-555-0105,Winnipeg,7941 Greenview Street,R3G2J6,1981-10-31,97911.0,4000.0,Divorced,Do not contact,1981
4,Dot Cloé Jonasen,902555-0157,Charlottetown,74 Monroe Street,C1A2V3,2001-07-25,NaN,NaN,NaN,Contact,2001

In [44]:
# now we can analyze the missing data and see if there are any patterns

df.groupby('City').apply(lambda x: x.isnull().sum())

,Name,PhoneNumber,City,Address,PostalCode,BirthDate,Income,CreditLimit,MaritalStatus,Contact,BirthYear
City,,,,,,,,,,,
Charlottetown,0,0,0,0,0,0,2,1,3,0,0
Ottawa,0,0,0,0,0,0,1,0,3,0,0
Toronto,0,0,0,0,0,0,1,0,0,0,0
Winnipeg,0,0,0,0,0,0,0,0,0,0,0
Yellowknife,0,0,0,0,0,0,0,0,0,0,0

In [48]:
df[df['CreditLimit'].isnull()]

,Name,PhoneNumber,City,Address,PostalCode,BirthDate,Income,CreditLimit,MaritalStatus,Contact,BirthYear
4,Dot Cloé Jonasen,902555-0157,Charlottetown,74 Monroe Street,C1A2V3,2001-07-25,NaN,NaN,NaN,Contact,2001

In [51]:
df[df['Income'].isnull()]

,Name,PhoneNumber,City,Address,PostalCode,BirthDate,Income,CreditLimit,MaritalStatus,Contact,BirthYear
2,Anita Travert,613-555-0111,Ottawa,24 Constitution St.,K2B8E3,1952-05-02,NaN,3000.0,Married,Do not contact,1952
4,Dot Cloé Jonasen,902555-0157,Charlottetown,74 Monroe Street,C1A2V3,2001-07-25,NaN,NaN,NaN,Contact,2001
7,Helgi Lessie Castelo,416-555-0159,Toronto,438 E. Cypress Ave.,M5V3N2,1962-03-15,NaN,500.0,Divorced,Do not contact,1962
22,Seosamh Gibb,902-555-0138,Charlottetown,931 Myers Ave.,C1A3W7,1991-09-09,NaN,3500.0,Divorced,Do not contact,1991

In [52]:
df[df['MaritalStatus'].isnull()]

,Name,PhoneNumber,City,Address,PostalCode,BirthDate,Income,CreditLimit,MaritalStatus,Contact,BirthYear
4,Dot Cloé Jonasen,902555-0157,Charlottetown,74 Monroe Street,C1A2V3,2001-07-25,NaN,NaN,NaN,Contact,2001
9,Pippa Stéphane Chevalier,902-555-0108,Charlottetown,692 Thompson Drive,C1C1N8,2003-06-06,125318.0,3000.0,NaN,Contact,2003
14,Donelle Rowland Coghlan,613-555-0154,Ottawa,5 Wilson Rd.,K2A3N2,1987-06-01,75545.0,1000.0,NaN,Do not contact,1987
19,Serafim Proudfoot,902-555-0190,Charlottetown,1 Sleepy Hollow Rd.,A0C1L0,1995-09-01,65460.0,3000.0,NaN,Do not contact,1995
24,Marlyn Mathias Sander,613-555-0165,Ottawa,35 Wayne Road,K2B8E3,1965-07-31,73759.0,3500.0,NaN,Do not contact,1965
29,Valéria Zuri Anthonyson,613-555-0139,Ottawa,779 E. Birch Hill Court,K2C2R3,1991-07-21,152555.0,5000.0,NaN,Do not contact,1991

In [50]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 11 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           30 non-null     object
 1   PhoneNumber    30 non-null     object
 2   City           30 non-null     object
 3   Address        30 non-null     object
 4   PostalCode     30 non-null     object
 5   BirthDate      30 non-null     datetime64[ns]
 6   Income         26 non-null     float64
 7   CreditLimit    29 non-null     float64
 8   MaritalStatus  24 non-null     object
 9   Contact        30 non-null     object
 10  BirthYear      30 non-null     int64
dtypes: datetime64[ns](1), float64(2), int64(1), object(7)
memory usage: 2.7+ KB

In [53]:
df.groupby('MaritalStatus').count()

,Name,PhoneNumber,City,Address,PostalCode,BirthDate,Income,CreditLimit,Contact,BirthYear
MaritalStatus,,,,,,,,,,
Divorced,7,7,7,7,7,7,5,7,7,7
Married,9,9,9,9,9,9,8,9,9,9
Single,8,8,8,8,8,8,8,8,8,8

In [54]:
# fill in missing data with a constant
df['MaritalStatus'] = df['MaritalStatus'].fillna('Unknown')

In [55]:
df.groupby('MaritalStatus').count()

,Name,PhoneNumber,City,Address,PostalCode,BirthDate,Income,CreditLimit,Contact,BirthYear
MaritalStatus,,,,,,,,,,
Divorced,7,7,7,7,7,7,5,7,7,7
Married,9,9,9,9,9,9,8,9,9,9
Single,8,8,8,8,8,8,8,8,8,8
Unknown,6,6,6,6,6,6,5,5,6,6

In [56]:
df['CreditLimit'].median()

3000.0

In [57]:
# Fill in missing data with a calculation -- median of a column
df['CreditLimit'] = df['CreditLimit'].fillna(df['CreditLimit'].median())

In [58]:
# Fill in missing data based on calculated metric by group
df.groupby(['City','MaritalStatus']).apply(lambda x: x.isnull().sum())

                             Name  PhoneNumber  City  Address  PostalCode  \
City          MaritalStatus
Charlottetown Divorced          0            0     0        0           0
              Married           0            0     0        0           0
              Single            0            0     0        0           0
              Unknown           0            0     0        0           0
Ottawa        Divorced          0            0     0        0           0
              Married           0            0     0        0           0
              Single            0            0     0        0           0
              Unknown           0            0     0        0           0
Toronto       Divorced          0            0     0        0           0
              Married           0            0     0        0           0
              Single            0            0     0        0           0
Winnipeg      Divorced          0            0     0        0           0
              Married           0            0     0        0           0
              Single            0            0     0        0           0
Yellowknife   Divorced          0            0     0        0           0
              Married           0            0     0        0           0
              Single            0            0     0        0           0

                             BirthDate  Income  CreditLimit  MaritalStatus  \
City          MaritalStatus
Charlottetown Divorced               0       1            0              0
              Married                0       0            0              0
              Single                 0       0            0              0
              Unknown                0       1            0              0
Ottawa        Divorced               0       0            0              0
              Married                0       1            0              0
              Single                 0       0            0              0
              Unknown                0       0            0              0
Toronto       Divorced               0       1            0              0
              Married                0       0            0              0
              Single                 0       0            0              0
Winnipeg      Divorced               0       0            0              0
              Married                0       0            0              0
              Single                 0       0            0              0
Yellowknife   Divorced               0       0            0              0
              Married                0       0            0              0
              Single                 0       0            0              0

                             Contact  BirthYear
City          MaritalStatus
Charlottetown Divorced             0          0
              Married              0          0
              Single               0          0
              Unknown              0          0
Ottawa        Divorced             0          0
              Married              0          0
              Single               0          0
              Unknown              0          0
Toronto       Divorced             0          0
              Married              0          0
              Single               0          0
Winnipeg      Divorced             0          0
              Married              0          0
              Single               0          0
Yellowknife   Divorced             0          0
              Married              0          0
              Single               0          0

In [60]:
df.groupby('City')['Income'].median()

City
Charlottetown    122042.0
Ottawa            75545.0
Toronto           75039.0
Winnipeg          79284.5
Yellowknife      122699.0
Name: Income, dtype: float64

In [64]:
df[['City','Income']].head()

            City    Income
0    Yellowknife   77569.0
1    Yellowknife  117630.0
2         Ottawa       NaN
3       Winnipeg   97911.0
4  Charlottetown       NaN

In [69]:
df.groupby('City')['Income'].transform('median')

0     122699.0
1     122699.0
2      75545.0
3      79284.5
4     122042.0
5     122042.0
6      79284.5
7      75039.0
8      79284.5
9     122042.0
10     75039.0
11    122042.0
12     79284.5
13     79284.5
14     75545.0
15     75545.0
16     75039.0
17    122699.0
18     75039.0
19    122042.0
20     75039.0
21     79284.5
22    122042.0
23     75545.0
24     75545.0
25    122699.0
26    122699.0
27     75039.0
28    122699.0
29     75545.0
Name: Income, dtype: float64

In [66]:
df['Income'] = df['Income'].fillna(df.groupby('City')['Income'].transform('median'))

In [67]:
df['Income']

0      77569.0
1     117630.0
2      75545.0
3      97911.0
4     122042.0
5     157027.0
6      60658.0
7      75039.0
8     152732.0
9     125318.0
10     68145.0
11    118766.0
12    120311.0
13     53013.0
14     75545.0
15    147312.0
16     57954.0
17    149273.0
18    256360.0
19     65460.0
20    155676.0
21     45923.0
22    122042.0
23     18475.0
24     73759.0
25     27138.0
26    127768.0
27     75039.0
28    145987.0
29    152555.0
Name: Income, dtype: float64

In [70]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 11 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           30 non-null     object
 1   PhoneNumber    30 non-null     object
 2   City           30 non-null     object
 3   Address        30 non-null     object
 4   PostalCode     30 non-null     object
 5   BirthDate      30 non-null     datetime64[ns]
 6   Income         30 non-null     float64
 7   CreditLimit    30 non-null     float64
 8   MaritalStatus  30 non-null     object
 9   Contact        30 non-null     object
 10  BirthYear      30 non-null     int64
dtypes: datetime64[ns](1), float64(2), int64(1), object(7)
memory usage: 2.7+ KB

In [72]:
df.describe(include = 'all')

,Name,PhoneNumber,City,Address,PostalCode,BirthDate,Income,CreditLimit,MaritalStatus,Contact,BirthYear
count,30,30,30,30,30,30,30.000000,30.000000,30,30,30.000000
unique,30,30,5,30,27,NaN,NaN,NaN,4,2,NaN
top,Thane Arthur Andrews,8675550155,Yellowknife,25 West Arlington Drive,R3R3B6,NaN,NaN,NaN,Married,Do not contact,NaN
freq,1,1,6,1,2,NaN,NaN,NaN,9,25,NaN
mean,NaN,NaN,NaN,NaN,NaN,1981-01-29 05:36:00,103932.400000,3053.333333,NaN,NaN,1980.633333
min,NaN,NaN,NaN,NaN,NaN,1952-05-02 00:00:00,18475.000000,500.000000,NaN,NaN,1952.000000
25%,NaN,NaN,NaN,NaN,NaN,1969-12-20 00:00:00,69548.500000,2500.000000,NaN,NaN,1969.500000
50%,NaN,NaN,NaN,NaN,NaN,1983-10-09 12:00:00,107770.500000,3000.000000,NaN,NaN,1983.500000
75%,NaN,NaN,NaN,NaN,NaN,1991-08-24 12:00:00,141432.250000,4000.000000,NaN,NaN,1991.000000
max,NaN,NaN,NaN,NaN,NaN,2003-06-06 00:00:00,256360.000000,5000.000000,NaN,NaN,2003.000000
std,NaN,NaN,NaN,NaN,NaN,NaN,49954.624336,1379.588478,NaN,NaN,14.970047

In [73]:
df2 = pd.read_csv('3250 B/Module 1/MessyData.csv')

In [75]:
df2.describe(include='all')

,Name,PhoneNumber,City,Address,PostalCode,BirthDate,Income,CreditLimit,MaritalStatus
count,30,30,30,30,30,30,26.000000,30,24
unique,30,30,9,30,27,30,NaN,10,3
top,Thane Arthur Andrews,8675550155,Yellowknife,25 West Arlington Drive,R3R3B6,30-Jan-87,NaN,3000,Married
freq,1,1,6,1,2,1,NaN,6,9
mean,NaN,NaN,NaN,NaN,NaN,NaN,104742.461538,NaN,NaN
std,NaN,NaN,NaN,NaN,NaN,NaN,52935.742490,NaN,NaN
min,NaN,NaN,NaN,NaN,NaN,NaN,18475.000000,NaN,NaN
25%,NaN,NaN,NaN,NaN,NaN,NaN,66131.250000,NaN,NaN
50%,NaN,NaN,NaN,NaN,NaN,NaN,107770.500000,NaN,NaN
75%,NaN,NaN,NaN,NaN,NaN,NaN,146980.750000,NaN,NaN
max,NaN,NaN,NaN,NaN,NaN,NaN,256360.000000,NaN,NaN

In [76]:
# using regular expressions to handle PATTERN related issues

In [77]:
df.head()

,Name,PhoneNumber,City,Address,PostalCode,BirthDate,Income,CreditLimit,MaritalStatus,Contact,BirthYear
0,Thane Arthur Andrews,8675550155,Yellowknife,25 West Arlington Drive,X1A3C7,1987-01-30,77569.0,500.0,Single,Do not contact,1987
1,Ty Tiina Hume,867-555-0148,Yellowknife,214 West Maple Dr.,X1A3J6,1991-09-05,117630.0,5000.0,Divorced,Do not contact,1991
2,Anita Travert,613-555-0111,Ottawa,24 Constitution St.,K2B8E3,1952-05-02,75545.0,3000.0,Married,Do not contact,1952
3,Odilon Vera Ó Maoil Riain,204-555-0105,Winnipeg,7941 Greenview Street,R3G2J6,1981-10-31,97911.0,4000.0,Divorced,Do not contact,1981
4,Dot Cloé Jonasen,902555-0157,Charlottetown,74 Monroe Street,C1A2V3,2001-07-25,122042.0,3000.0,Unknown,Contact,2001

In [78]:
import re

In [79]:
df['PhoneNumber'].unique()

array(['8675550155', '867-555-0148', '613-555-0111', '204-555-0105',
       '902555-0157', '902-555-0177', '204-555-0136', '416-555-0159',
       '204-555-0189', '902-555-0108', '416-5550167', '902-555-0195',
       '204-555-0195', '204-555-0180', '613-555-0154', '613-555-0150',
       '416-5550180', '867-555-0113', '416-555-0192', '902-555-0190',
       '4165550170', '204-555-0190', '902-555-0138', '613-555-0116',
       '613-555-0165', '867-555-0158', '867-555-0161', '416-555-0198',
       '867-555-0134', '613-555-0139'], dtype=object)

In [84]:
pattern1 = re.compile(r'(\d{3})-(\d{3})-(\d{4})') # or you can use \d\d\d\-\d\d\d-\d\d\d\d

In [85]:
pattern1.search('867-555-0148')

In [88]:
print(pattern1.search('8675550148'))

None

In [89]:
pn = '8675550148'
print(pn[:3])
print(pn[3:6])
print(pn[6:])

867
555
0148

In [91]:
pn = '867-5550148'
print(pn[:7])
print(pn[7:])

867-555
0148

In [92]:
def fix_phone(x):
    pattern1 = re.compile(r'(\d{3})-(\d{3})-(\d{4})')
    pattern2 = re.compile(r'(\d{10})')
    pattern3 = re.compile(r'(\d{6})-(\d{4})')
    pattern4 = re.compile(r'(\d{3})-(\d{7})')

    if pattern1.search(x) != None:
        return x
    elif pattern2.search(x) != None:
        return '-'.join([x[:3],x[3:6],x[6:]])
    elif pattern3.search(x) != None:
        return '-'.join([x[:3],x[3:]])
    elif pattern4.search(x) != None:
        return '-'.join([x[:7],x[7:]])
    else:
        return "Pattern not found"

In [93]:
df['PhoneNumber_Fixed'] = df['PhoneNumber'].apply(fix_phone)

In [96]:
df[['PhoneNumber','PhoneNumber_Fixed']].head()

    PhoneNumber PhoneNumber_Fixed
0    8675550155      867-555-0155
1  867-555-0148      867-555-0148
2  613-555-0111      613-555-0111
3  204-555-0105      204-555-0105
4   902555-0157      902-555-0157

In [97]:
# check for pattern not found
df[df['PhoneNumber_Fixed'] == 'Pattern not found']

Empty DataFrame
Columns: [Name, PhoneNumber, City, Address, PostalCode, BirthDate, Income, CreditLimit, MaritalStatus, Contact, BirthYear, PhoneNumber_Fixed]
Index: []

In [98]:
df.head()

,Name,PhoneNumber,City,Address,PostalCode,BirthDate,Income,CreditLimit,MaritalStatus,Contact,BirthYear,PhoneNumber_Fixed
0,Thane Arthur Andrews,8675550155,Yellowknife,25 West Arlington Drive,X1A3C7,1987-01-30,77569.0,500.0,Single,Do not contact,1987,867-555-0155
1,Ty Tiina Hume,867-555-0148,Yellowknife,214 West Maple Dr.,X1A3J6,1991-09-05,117630.0,5000.0,Divorced,Do not contact,1991,867-555-0148
2,Anita Travert,613-555-0111,Ottawa,24 Constitution St.,K2B8E3,1952-05-02,75545.0,3000.0,Married,Do not contact,1952,613-555-0111
3,Odilon Vera Ó Maoil Riain,204-555-0105,Winnipeg,7941 Greenview Street,R3G2J6,1981-10-31,97911.0,4000.0,Divorced,Do not contact,1981,204-555-0105
4,Dot Cloé Jonasen,902555-0157,Charlottetown,74 Monroe Street,C1A2V3,2001-07-25,122042.0,3000.0,Unknown,Contact,2001,902-555-0157

In [99]:
# drop old phone number column
df.drop('PhoneNumber', axis=1, inplace=True)

In [100]:
df.head()

,Name,City,Address,PostalCode,BirthDate,Income,CreditLimit,MaritalStatus,Contact,BirthYear,PhoneNumber_Fixed
0,Thane Arthur Andrews,Yellowknife,25 West Arlington Drive,X1A3C7,1987-01-30,77569.0,500.0,Single,Do not contact,1987,867-555-0155
1,Ty Tiina Hume,Yellowknife,214 West Maple Dr.,X1A3J6,1991-09-05,117630.0,5000.0,Divorced,Do not contact,1991,867-555-0148
2,Anita Travert,Ottawa,24 Constitution St.,K2B8E3,1952-05-02,75545.0,3000.0,Married,Do not contact,1952,613-555-0111
3,Odilon Vera Ó Maoil Riain,Winnipeg,7941 Greenview Street,R3G2J6,1981-10-31,97911.0,4000.0,Divorced,Do not contact,1981,204-555-0105
4,Dot Cloé Jonasen,Charlottetown,74 Monroe Street,C1A2V3,2001-07-25,122042.0,3000.0,Unknown,Contact,2001,902-555-0157

In [105]:
name_ex = df['Name'].head(2)

In [113]:
#name_ex.to_frame()['Name']#.str.split(' ', expand=True)

                   Name
0  Thane Arthur Andrews
1         Ty Tiina Hume

In [117]:
df.head()

,Name,City,Address,PostalCode,BirthDate,Income,CreditLimit,MaritalStatus,Contact,BirthYear,PhoneNumber_Fixed
0,Thane Arthur Andrews,Yellowknife,25 West Arlington Drive,X1A3C7,1987-01-30,77569.0,500.0,Single,Do not contact,1987,867-555-0155
1,Ty Tiina Hume,Yellowknife,214 West Maple Dr.,X1A3J6,1991-09-05,117630.0,5000.0,Divorced,Do not contact,1991,867-555-0148
2,Anita Travert,Ottawa,24 Constitution St.,K2B8E3,1952-05-02,75545.0,3000.0,Married,Do not contact,1952,613-555-0111
3,Odilon Vera Ó Maoil Riain,Winnipeg,7941 Greenview Street,R3G2J6,1981-10-31,97911.0,4000.0,Divorced,Do not contact,1981,204-555-0105
4,Dot Cloé Jonasen,Charlottetown,74 Monroe Street,C1A2V3,2001-07-25,122042.0,3000.0,Unknown,Contact,2001,902-555-0157

In [130]:
df['Name'] = df['Name'].str.replace(r'\s+', ' ', regex=True)

In [134]:
df[['FName','LName']] = df['Name'].str.rsplit(' ', n=1, expand=True)

In [135]:
df.head()

,Name,City,Address,PostalCode,BirthDate,Income,CreditLimit,MaritalStatus,Contact,BirthYear,PhoneNumber_Fixed,FName,LName
0,Thane Arthur Andrews,Yellowknife,25 West Arlington Drive,X1A3C7,1987-01-30,77569.0,500.0,Single,Do not contact,1987,867-555-0155,Thane Arthur,Andrews
1,Ty Tiina Hume,Yellowknife,214 West Maple Dr.,X1A3J6,1991-09-05,117630.0,5000.0,Divorced,Do not contact,1991,867-555-0148,Ty Tiina,Hume
2,Anita Travert,Ottawa,24 Constitution St.,K2B8E3,1952-05-02,75545.0,3000.0,Married,Do not contact,1952,613-555-0111,Anita,Travert
3,Odilon Vera Ó Maoil Riain,Winnipeg,7941 Greenview Street,R3G2J6,1981-10-31,97911.0,4000.0,Divorced,Do not contact,1981,204-555-0105,Odilon Vera Ó Maoil,Riain
4,Dot Cloé Jonasen,Charlottetown,74 Monroe Street,C1A2V3,2001-07-25,122042.0,3000.0,Unknown,Contact,2001,902-555-0157,Dot Cloé,Jonasen

In [136]:
df.drop('Name', axis=1, inplace=True)

In [137]:
df.columns

Index(['City', 'Address', 'PostalCode', 'BirthDate', 'Income', 'CreditLimit',
       'MaritalStatus', 'Contact', 'BirthYear', 'PhoneNumber_Fixed', 'FName',
       'LName'],
      dtype='object')

In [139]:
# reordering columns
df = df[['LName','FName','BirthDate', 'City', 'Address','PostalCode','PhoneNumber_Fixed', 'MaritalStatus', 'Income', 'CreditLimit']]

In [140]:
# renaming phone number column
df.rename(columns={'PhoneNumber_Fixed':'PhoneNumber'}, inplace=True)

/var/folders/75/tr_v06ms4k7gy38vcppxbcf80000gn/T/ipykernel_16633/3684913693.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.rename(columns={'PhoneNumber_Fixed':'PhoneNumber'}, inplace=True)

In [141]:
df.head()

,LName,FName,BirthDate,City,Address,PostalCode,PhoneNumber,MaritalStatus,Income,CreditLimit
0,Andrews,Thane Arthur,1987-01-30,Yellowknife,25 West Arlington Drive,X1A3C7,867-555-0155,Single,77569.0,500.0
1,Hume,Ty Tiina,1991-09-05,Yellowknife,214 West Maple Dr.,X1A3J6,867-555-0148,Divorced,117630.0,5000.0
2,Travert,Anita,1952-05-02,Ottawa,24 Constitution St.,K2B8E3,613-555-0111,Married,75545.0,3000.0
3,Riain,Odilon Vera Ó Maoil,1981-10-31,Winnipeg,7941 Greenview Street,R3G2J6,204-555-0105,Divorced,97911.0,4000.0
4,Jonasen,Dot Cloé,2001-07-25,Charlottetown,74 Monroe Street,C1A2V3,902-555-0157,Unknown,122042.0,3000.0